----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/monicaelgawly/Downloads/metrics/multnr_monica_answers.log
  log type:  text
 opened on:  30 Mar 2018, 23:37:45

. use "/Users/monicaelgawly/Downloads/HTV.dta"

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        wage |      1,193    13.23942    9.116401   1.023529   91.30922
        abil |      1,193    1.805191    2.169927  -5.631463   6.263742
        educ |      1,193    13.03437    2.346208          6         20
          ne |      1,193     .210394    .4077594          0          1
          nc |      1,193    .3730092    .4838073          0          1
-------------+---------------------------------------------------------
        west |      1,193    .1684828    .3744514          0          1
       south |      1,193     .248114    .4320995          0          1
       exper |      1,193    10.72842    3.105527          1         19
    motheduc |      1,193    12.17519    2.282187          0         20
    fatheduc |      1,193    12.44258      3.2721          0         20
-------------+---------------------------------------------------------
    brkhme14 |      1,193    .1659681    .3722081          0          1
        sibs |      1,193    2.955574    1.860181          0         13
       urban |      1,193    .8147527     .388661          0          1
        ne18 |      1,193    .2279966    .4197164          0          1
        nc18 |      1,193    .4115675    .4923239          0          1
-------------+---------------------------------------------------------
     south18 |      1,193    .2145851    .4107064          0          1
      west18 |      1,193    .1458508    .3531046          0          1
     urban18 |      1,193    .8751048    .3307387          0          1
      tuit17 |      1,193    8.537157    4.121537          0   18.17392
      tuit18 |      1,193    8.557239    4.042644          0   18.17392
-------------+---------------------------------------------------------
       lwage |      1,193    2.408684    .5960768   .0232569   4.514252
     expersq |      1,193    124.7351    66.80132          1        361
       ctuit |      1,193    .0200824    .8146919  -7.623878   9.173661

. gen highschedu=educ=12;
invalid syntax
r(198);

. gen highschedu=educ=12
invalid syntax
r(198);

. ge highschedu=0

. replace highschool=1 if educ==12
variable highschool not found
r(111);

. replace highschedu=1 if educ==12
(498 real changes made)

. tab highschedu

 highschedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        695       58.26       58.26
          1 |        498       41.74      100.00
------------+-----------------------------------
      Total |      1,193      100.00

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        wage |      1,193    13.23942    9.116401   1.023529   91.30922
        abil |      1,193    1.805191    2.169927  -5.631463   6.263742
        educ |      1,193    13.03437    2.346208          6         20
          ne |      1,193     .210394    .4077594          0          1
          nc |      1,193    .3730092    .4838073          0          1
-------------+---------------------------------------------------------
        west |      1,193    .1684828    .3744514          0          1
       south |      1,193     .248114    .4320995          0          1
       exper |      1,193    10.72842    3.105527          1         19
    motheduc |      1,193    12.17519    2.282187          0         20
    fatheduc |      1,193    12.44258      3.2721          0         20
-------------+---------------------------------------------------------
    brkhme14 |      1,193    .1659681    .3722081          0          1
        sibs |      1,193    2.955574    1.860181          0         13
       urban |      1,193    .8147527     .388661          0          1
        ne18 |      1,193    .2279966    .4197164          0          1
        nc18 |      1,193    .4115675    .4923239          0          1
-------------+---------------------------------------------------------
     south18 |      1,193    .2145851    .4107064          0          1
      west18 |      1,193    .1458508    .3531046          0          1
     urban18 |      1,193    .8751048    .3307387          0          1
      tuit17 |      1,193    8.537157    4.121537          0   18.17392
      tuit18 |      1,193    8.557239    4.042644          0   18.17392
-------------+---------------------------------------------------------
       lwage |      1,193    2.408684    .5960768   .0232569   4.514252
     expersq |      1,193    124.7351    66.80132          1        361
       ctuit |      1,193    .0200824    .8146919  -7.623878   9.173661
  highschedu |      1,193     .417435    .4933427          0          1

. reg educ motheduc fatheduc

      Source |       SS           df       MS      Number of obs   =     1,193
-------------+----------------------------------   F(2, 1190)      =    201.32
       Model |  1658.85617         2  829.428084   Prob > F        =    0.0000
    Residual |  4902.73478     1,190  4.11994519   R-squared       =    0.2528
-------------+----------------------------------   Adj R-squared   =    0.2516
       Total |  6561.59095     1,192  5.50469039   Root MSE        =    2.0298

------------------------------------------------------------------------------
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    motheduc |   .3133269   .0320423     9.78   0.000     .2504612    .3761925
    fatheduc |   .1848613   .0223485     8.27   0.000     .1410145    .2287081
       _cons |   6.919402   .3224073    21.46   0.000     6.286852    7.551952
------------------------------------------------------------------------------

. reg educ motheduc fatheduc, r

Linear regression                               Number of obs     =      1,193
                                                F(2, 1190)        =     166.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2528
                                                Root MSE          =     2.0298

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    motheduc |   .3133269   .0390176     8.03   0.000     .2367759    .3898778
    fatheduc |   .1848613   .0259798     7.12   0.000       .13389    .2358326
       _cons |   6.919402   .3610376    19.17   0.000     6.211061    7.627743
------------------------------------------------------------------------------

. reg educ motheduc fatheduc, vce(robust) 

Linear regression                               Number of obs     =      1,193
                                                F(2, 1190)        =     166.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2528
                                                Root MSE          =     2.0298

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    motheduc |   .3133269   .0390176     8.03   0.000     .2367759    .3898778
    fatheduc |   .1848613   .0259798     7.12   0.000       .13389    .2358326
       _cons |   6.919402   .3610376    19.17   0.000     6.211061    7.627743
------------------------------------------------------------------------------

. reg educ abil motheduc fatheduc

      Source |       SS           df       MS      Number of obs   =     1,193
-------------+----------------------------------   F(3, 1189)      =    291.62
       Model |  2781.42227         3  927.140756   Prob > F        =    0.0000
    Residual |  3780.16868     1,189    3.179284   R-squared       =    0.4239
-------------+----------------------------------   Adj R-squared   =    0.4224
       Total |  6561.59095     1,192  5.50469039   Root MSE        =    1.7831

------------------------------------------------------------------------------
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        abil |   .4958059   .0263858    18.79   0.000     .4440379    .5475738
    motheduc |   .1937562    .028858     6.71   0.000      .137138    .2503745
    fatheduc |   .1093409   .0200393     5.46   0.000     .0700246    .1486572
       _cons |   8.419842   .2942611    28.61   0.000     7.842513    8.997171
------------------------------------------------------------------------------

. reg educ abil motheduc fatheduc, r

Linear regression                               Number of obs     =      1,193
                                                F(3, 1189)        =     249.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4239
                                                Root MSE          =     1.7831

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        abil |   .4958059   .0281263    17.63   0.000     .4406232    .5509885
    motheduc |   .1937562   .0344251     5.63   0.000     .1262154     .261297
    fatheduc |   .1093409   .0237096     4.61   0.000     .0628236    .1558581
       _cons |   8.419842   .3300946    25.51   0.000     7.772209    9.067474
------------------------------------------------------------------------------

. reg educ motheduc fatheduc abil, r

Linear regression                               Number of obs     =      1,193
                                                F(3, 1189)        =     249.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4239
                                                Root MSE          =     1.7831

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    motheduc |   .1937562   .0344251     5.63   0.000     .1262154     .261297
    fatheduc |   .1093409   .0237096     4.61   0.000     .0628236    .1558581
        abil |   .4958059   .0281263    17.63   0.000     .4406232    .5509885
       _cons |   8.419842   .3300946    25.51   0.000     7.772209    9.067474
------------------------------------------------------------------------------

. test motheduc fatheduc

 ( 1)  motheduc = 0
 ( 2)  fatheduc = 0

       F(  2,  1189) =   63.11
            Prob > F =    0.0000

. test motheduc-(2*fatheduc)=0

 ( 1)  motheduc - 2*fatheduc = 0

       F(  1,  1189) =    0.12
            Prob > F =    0.7331

. save "/Users/monicaelgawly/Downloads/HTV.dta", replace
file /Users/monicaelgawly/Downloads/HTV.dta saved

. clear

