-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jessicavanparys/Dropbox/Working_Docs/teaching/ECO321/Assignments/Assi
> gnment_3/vanparys-assignment-3-solutions.log
  log type:  text
 opened on:   6 Nov 2017, 10:08:04

. 
. *======================================================================================
> ====
. *Set a delimiter that allows wrap-around text
. *======================================================================================
> ====
. 
. #delimit;
delimiter now ;
. *======================================================================================
> ====;
. *======================================================================================
> ====;
. *======================================================================================
> ====;
. *Question 2;
. *======================================================================================
> ====;
. *Open the data set called HTV.dta;
. *======================================================================================
> ====;
. use "/Users/jessicavanparys/Dropbox/Working_Docs/teaching/ECO321/Assignments/Assignment
> _3/HTV.dta";

. *======================================================================================
> ====;
. *(a): 
> *======================================================================================
> ====;
. su educ, detail;

               highest grade completed by 1991
-------------------------------------------------------------
      Percentiles      Smallest
 1%            8              6
 5%            9              6
10%           10              7       Obs               1,193
25%           12              7       Sum of Wgt.       1,193

50%           12                      Mean           13.03437
                        Largest       Std. Dev.      2.346208
75%           15             20
90%           16             20       Variance        5.50469
95%           17             20       Skewness       .4375011
99%           20             20       Kurtosis       3.501292

. ge educ12=0;

. replace educ12=1 if educ==12;
(498 real changes made)

. tab educ12;

     educ12 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        695       58.26       58.26
          1 |        498       41.74      100.00
------------+-----------------------------------
      Total |      1,193      100.00

. su educ motheduc fatheduc;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        educ |      1,193    13.03437    2.346208          6         20
    motheduc |      1,193    12.17519    2.282187          0         20
    fatheduc |      1,193    12.44258      3.2721          0         20

. *======================================================================================
> ====;
. *(b);
. *======================================================================================
> ====;
. reg educ motheduc fatheduc, r;

Linear regression                               Number of obs     =      1,193
                                                F(2, 1190)        =     166.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2528
                                                Root MSE          =     2.0298

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    motheduc |   .3133269   .0390176     8.03   0.000     .2367759    .3898778
    fatheduc |   .1848613   .0259798     7.12   0.000       .13389    .2358326
       _cons |   6.919402   .3610376    19.17   0.000     6.211061    7.627743
------------------------------------------------------------------------------

. *======================================================================================
> ====;
. *(c);
. *======================================================================================
> ====;
. reg educ motheduc fatheduc abil, r;

Linear regression                               Number of obs     =      1,193
                                                F(3, 1189)        =     249.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4239
                                                Root MSE          =     1.7831

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    motheduc |   .1937562   .0344251     5.63   0.000     .1262154     .261297
    fatheduc |   .1093409   .0237096     4.61   0.000     .0628236    .1558581
        abil |   .4958059   .0281263    17.63   0.000     .4406232    .5509885
       _cons |   8.419842   .3300946    25.51   0.000     7.772209    9.067474
------------------------------------------------------------------------------

. *======================================================================================
> ====;
. *(d);
. *======================================================================================
> ====;
. *Discuss OVB;
. *======================================================================================
> ====;
. *(e);
. *======================================================================================
> ====;
. *Use F-statistic;
. test motheduc=2*fatheduc;

 ( 1)  motheduc - 2*fatheduc = 0

       F(  1,  1189) =    0.12
            Prob > F =    0.7331

. *Rearrange regression;
. ge newvar=(2*motheduc)+fatheduc;

. reg educ motheduc newvar abil, r;

Linear regression                               Number of obs     =      1,193
                                                F(3, 1189)        =     249.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4239
                                                Root MSE          =     1.7831

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    motheduc |  -.0249255    .073067    -0.34   0.733      -.16828     .118429
      newvar |   .1093409   .0237096     4.61   0.000     .0628236    .1558581
        abil |   .4958059   .0281263    17.63   0.000     .4406232    .5509885
       _cons |   8.419842   .3300946    25.51   0.000     7.772209    9.067474
------------------------------------------------------------------------------

. *======================================================================================
> ====;
. *======================================================================================
> ====;
. *======================================================================================
> ====;
. *Question 2;
. *======================================================================================
> ====;
. *Open the wage1.dta data set;
. *======================================================================================
> ====;
. use "/Users/jessicavanparys/Dropbox/Working_Docs/teaching/ECO321/Assignments/Assignment
> _3/wage1.dta", clear;

. *======================================================================================
> ====;
. *(a): 
> *======================================================================================
> ====;
. reg lwage edu exper expersq, r;

Linear regression                               Number of obs     =        526
                                                F(3, 522)         =      71.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3003
                                                Root MSE          =     .44591

------------------------------------------------------------------------------
             |               Robust
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0903658   .0077827    11.61   0.000     .0750766     .105655
       exper |   .0410089   .0050237     8.16   0.000     .0311398     .050878
     expersq |  -.0007136   .0001098    -6.50   0.000    -.0009292   -.0004979
       _cons |   .1279975   .1071261     1.19   0.233    -.0824537    .3384487
------------------------------------------------------------------------------

. *======================================================================================
> ====;
. *(b);
. *======================================================================================
> ====;
. *Each additional year of education increases wages by 9%. The effect is statistically
> significant beyond the 1% level;
. *======================================================================================
> ====;
. *(c);
. *======================================================================================
> ====;
. test exper expersq;

 ( 1)  exper = 0
 ( 2)  expersq = 0

       F(  2,   522) =   43.20
            Prob > F =    0.0000

. *Exper and expersq are jointly statistically significant. We conclude that experience
> has a statistically significant effect on log(wages);
. *======================================================================================
> ====;
. *(d);
. *======================================================================================
> ====;
. test expersq;

 ( 1)  expersq = 0

       F(  1,   522) =   42.25
            Prob > F =    0.0000

. *Experience-squared is statistically significant beyond the 1% level. We conclude that 
> the
> relationship between experience and wages is nonlinear;
. *======================================================================================
> ====;
. *(e);
. *======================================================================================
> ====;
. ge b2=_b[exper];

. ge b3=_b[expersq];

. ge chg_wage5=100*(b2+(2*b3*5));

. display chg_wage5;
3.3873293

. ge chg_wage20=100*(b2+(2*b3*20));

. display chg_wage20;
1.2466547

. *Plugging in different starting values for experience (e.g., 5 and 20) shows that exper
> ience
> exhibits diminishing marginal returns;
. *======================================================================================
> ====;
. *(f);
. *======================================================================================
> ====;
. *Holding education constant, the difference in log(wages) between someone with 10 and 2
> 0
> years of experience is...;
. *beta_2(20-10)+beta_3(20^(2)-10^(2))=0.041(10)-0.0007(400-100)=0.41-0.21=0.20;
. *So someone with 20 years of experience earns 20% more than someone with 10 years of 
> experience, holding everything else constant;
. *======================================================================================
> ====;
. *(g);
. *======================================================================================
> ====;
. ge turn=(-1*b2)/(2*b3);

. tab turn;

       turn |      Freq.     Percent        Cum.
------------+-----------------------------------
   28.73548 |        526      100.00      100.00
------------+-----------------------------------
      Total |        526      100.00

. ge high_exp=exper>28.74;

. su high_exp;

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    high_exp |        526     .230038    .4212575          0          1

. *======================================================================================
> ====;
. *======================================================================================
> ====;
. *======================================================================================
> ====;
. clear;

. 
end of do-file

. exit
